In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\YAMUNA\OneDrive\Documents\TEMP.csv")
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [3]:
df.isnull()

   Temperature  Humidity   city
0        False     False  False
1        False     False  False
2        False     False  False
3        False     False  False
4        False     False  False
5        False     False  False
6        False     False  False

# exploring data

In [4]:
df.head()

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad

In [5]:
df.tail()

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [9]:
df['Temperature']=df['Temperature'].fillna(df['Temperature'].mean())
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [11]:
df['Humidity']=df['Humidity'].fillna(df['Humidity'].sum())
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [12]:
df.shape

(7, 3)

In [13]:
df.columns

Index(['Temperature', 'Humidity', 'city'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [15]:
df.dtypes

Temperature     int64
Humidity        int64
city           object
dtype: object

In [16]:
df.city

0    Hyderabad
1    Hyderabad
2    Hyderabad
3    Hyderabad
4    Hyderabad
5      Chennai
6      Chennai
Name: city, dtype: object

In [17]:
df.info

<bound method DataFrame.info of    Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai>

In [18]:
df[2:6]

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai

# creating database

In [19]:
data=({
    "Name":["Niha","Kavs","Vinay","Sri","Sai","Sagarika","Raju"],
    "Age": [12,23,45,67,23,23,12]
})
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [20]:
df.tail()

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [21]:
df.head()

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad

In [22]:
df.shape

(7, 3)

In [23]:
df.dtypes

Temperature     int64
Humidity        int64
city           object
dtype: object

In [24]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [25]:
df.isnull()

   Temperature  Humidity   city
0        False     False  False
1        False     False  False
2        False     False  False
3        False     False  False
4        False     False  False
5        False     False  False
6        False     False  False

In [26]:
df.info

<bound method DataFrame.info of    Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai>

In [27]:
df[2:6]

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai

In [ ]:
df['Temperature']=df['Temperature'].fillna(df['Temperature'].mean())